app/controllers/home_controller.rb

  def index
		@posts = Post.find_last_to_posts
---
SELECT * FROM `posts` ORDER BY title